SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @brief   Standalone Camera Snapshot Capture — NUCLEO-N657X0-Q
 *
 *   Captures images from the CMW-IMX335 camera module and stores them as
 *   raw YUV422 frames on a microSD card.  No USB/UVC, no FileX/fatfs,
 *   no PC connection required after flashing.
 *
 *   Hardware:
 *     - MCU:      STM32N657 (NUCLEO-N657X0-Q / MB1940)
 *     - Camera:   CMW-IMX335 (5 MP, YUV422 output via CSI-2)
 *     - Storage:  microSD card (SDMMC2, 4-bit bus)
 *     - Button:   USER B1 = PC13 (active HIGH, external pull-down)
 *     - LEDs:     RED = PG10, GREEN = PG0
 *
 *   Flow (OPTIMIZED - Sleep Mode):
 *     1. Boot → init clocks, MPU, PSRAM, SD card
 *     2. Init camera + warmup frames (one-time cost at boot)
 *     3. STOP camera pipe (sleep = low power, fast wakeup)
 *     4. GREEN LED on (system ready)
 *     5. User presses USER button (PC13)
 *     6. START pipe → 3 frames → capture → STOP pipe (~100ms total)
 *     7. Frame saved to SD card
 *     8. Back to sleep → wait for next press
 *
 *   Two FreeRTOS tasks:
 *     - main_thread: board init, SD card init, camera sleep mode init, then deletes
 *     - btn_thread:  polls USER button, triggers fast capture + SD write
 *
 *   All configurable parameters are in Inc/app_config.h.
 ******************************************************************************
 */

#include <assert.h>
#include <stdio.h>
#include <string.h>

/* ---- STM32 HAL / BSP ---- */
#include "stm32n6xx_hal_conf.h"
#include "stm32n6xx_hal.h"
#include "stm32n6xx_hal_sd.h"
#include "stm32n6xx_hal_rif.h"
//#include "stm32n6xx_nucleo.h"
//#include "stm32n6xx_nucleo_bus.h"
//#include "stm32n6xx_nucleo_xspi.h"

#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_bus.h"
#include "stm32n6570_discovery_xspi.h"


#include "ws2812.h"

/* ---- Application ---- */
#include "app_config.h"
#include "app_cam.h"
#include "app_fuseprogramming.h"
#include "main.h"
#include "npu_cache.h"
#include "utils.h"

/* ---- FreeRTOS ---- */
#include "FreeRTOS.h"
#include "task.h"

/* ================================================================
   GLOBAL HANDLES
   ================================================================ */

UART_HandleTypeDef huart1;
SD_HandleTypeDef hsd1;

TIM_HandleTypeDef htim1;
DMA_HandleTypeDef handle_GPDMA1_Channel1;

/* ================================================================
   FREERTOS TASK CONTROL BLOCKS AND STACKS
   ============================================================ */

static StaticTask_t    main_thread_cb;
static StackType_t     main_thread_stack[configMINIMAL_STACK_SIZE];

static StaticTask_t    btn_thread_cb;
static StackType_t     btn_thread_stack[4 * configMINIMAL_STACK_SIZE];

/* ================================================================
   FORWARD DECLARATIONS
   ================================================================ */

static void  SystemClock_Config(void);
static void  Security_Config(void);
static void  IAC_Config(void);
static void  CONSOLE_Config(void);
static void  Setup_Mpu(void);
static int   main_freertos(void);
static void  main_thread_fct(void *arg);
static void  btn_thread_fct(void *arg);
static void  SD_Benchmarks(void);
static int   SD_StoreRawImage(const uint8_t *img_buf, uint32_t img_size,
                              uint32_t w, uint32_t h, uint32_t pixel_format);
static int   SD_ReadRawImage(uint8_t *img_buf, uint32_t *data_size_p);
static void  MX_TIM1_Init(void);

extern void  vPortSetupTimerInterrupt(void);
extern int   __uncached_bss_start__;
extern int   __uncached_bss_end__;


void PeriphCommonClock_Config(void);
static void MX_GPDMA1_Init(void);


/* ================================================================
   RUNTIME STATE
   ================================================================ */

static volatile int system_ready = 0;
static uint32_t snap_count = 0;
static uint32_t snap_base_block = SD_SNAP_BASE_BLOCK;

/** Camera frame buffer — allocated in PSRAM for DMA access */
static uint8_t capture_buf[MAX_SNAP_FRAME_SIZE] ALIGN_32 IN_PSRAM;

/** SD batch-write buffer — allocated in PSRAM for multi-block writes.
    Size = SD_BATCH_WRITE_BLOCKS * SD_BLOCK_SIZE = 64 * 512 = 32 KB.
    This buffer holds multiple 512-byte SD blocks so we can write them
    in a single HAL_SD_WriteBlocks() call, drastically reducing the
    number of HAL API calls per snapshot (~307 instead of ~19,643). */
static uint8_t sd_batch_buf[SD_BATCH_WRITE_BLOCKS * SD_BLOCK_SIZE] ALIGN_32 IN_PSRAM;

/* ================================================================
   SD CARD IMAGE HEADER FORMAT
   ================================================================ */

typedef struct {
    uint32_t magic;
    uint32_t width;
    uint32_t height;
    uint32_t pixel_format;
    uint32_t data_size;
    uint32_t timestamp;
    uint32_t checksum;
    uint32_t snap_id;
    uint8_t  reserved[28];
} sd_image_header_t;

#define SD_HEADER_TAG       0x49444745U

static uint32_t SD_IMG_BASE_BLOCK = 1000;

/* ================================================================
   ENTRY POINT
   ================================================================ */

int main(void)
{
    MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;
    __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
    __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);
    HAL_Init();
    Setup_Mpu();
    SCB_EnableICache();

#if defined(USE_DCACHE)
    MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
    SCB_EnableDCache();
#endif

    return main_freertos();
}

/* ================================================================
   MPU SETUP
   ================================================================ */

static void Setup_Mpu(void)
{
    MPU_Attributes_InitTypeDef attr;
    MPU_Region_InitTypeDef     region;

    attr.Number     = MPU_ATTRIBUTES_NUMBER0;
    attr.Attributes = MPU_NOT_CACHEABLE;
    HAL_MPU_ConfigMemoryAttributes(&attr);

    region.Enable           = MPU_REGION_ENABLE;
    region.Number           = MPU_REGION_NUMBER0;
    region.BaseAddress      = (uint32_t)&__uncached_bss_start__;
    region.LimitAddress     = (uint32_t)&__uncached_bss_end__ - 1;
    region.AttributesIndex  = MPU_ATTRIBUTES_NUMBER0;
    region.AccessPermission = MPU_REGION_ALL_RW;
    region.DisableExec      = MPU_INSTRUCTION_ACCESS_ENABLE;
    region.DisablePrivExec  = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
    region.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
    HAL_MPU_ConfigRegion(&region);
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
    memset(&__uncached_bss_start__, 0, &__uncached_bss_end__ - &__uncached_bss_start__);
}

/* ================================================================
   SECURITY CONFIGURATION
   ================================================================ */

static void Security_Config(void)
{
    __HAL_RCC_RIFSC_CLK_ENABLE();
    __HAL_RCC_SYSCFG_CLK_ENABLE();
    volatile uint32_t delay = 1000;
    while (delay--);

    RIMC_MasterConfig_t RIMC_master = {0};
    RIMC_master.MasterCID = RIF_CID_1;
    RIMC_master.SecPriv   = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;

    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU,    &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DMA2D,  &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DCMIPP, &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1,  &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2,  &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_OTG1,   &RIMC_master);

    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU,    RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DMA2D,  RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_CSI,    RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DCMIPP, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC,   RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_JPEG,   RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_OTG1HS, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);

    // Configure GPDMA1 channel 2
    if (HAL_DMA_ConfigChannelAttributes(&handle_GPDMA1_Channel1,
                                        DMA_CHANNEL_SEC | DMA_CHANNEL_PRIV |
                                        DMA_CHANNEL_SRC_SEC | DMA_CHANNEL_DEST_SEC) != HAL_OK) {

    	//Error_Handler();
    }

    // Configure GPIO PD7
    HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_9, GPIO_PIN_SEC | GPIO_PIN_NPRIV);





